#include <iostream>
#include <time.h>	

void main()
{
	/*
	반복문 : 원하는 코드를 원하는 수만큼 반복해서 동작시켜줄 때 사용하는 문법이다.
	for, while, do while 3가지 문법이 지원된다.

	for( 초기값; 조건식; 증감값)
	{
		동작할 코드
	}
	초기값 : for문이 시작할 때 한번만 동작이 된다.
	조건식 : for문이 시작할 때부터 반복되는 동안 매범 동작이 된다.
	증감값 : for문이 시작하고 1번 동작한 이후부터 매번 동작이 된다.

	조건식이 true,이면 코드 동작 ,false이면 for문을 빠져나간다,

	초기값 -> 조건식 체크(true) -> 코드 -> 증감값 -> 조건식 체크 (true) -> 코드 -> 증감 -> ... -> 조건(false) 빠져나감


	*/
	// i = 0 실행 -> 0 <10 -> 코드 -> 1 ->
	for (int i = 0; i < 10; ++i)
	{


	}
}